{
    "version": "https://jsonfeed.org/version/1",
    "title": "kyle-taylor",
    "description": "",
    "home_page_url": "http://www.kyletaylored.com",
    "feed_url": "http://www.kyletaylored.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Kyle Taylor"
    },
    "items": [
        {
            "id": "http://www.kyletaylored.com/how-to-fund-your-gaming-startup-on-kickstarter-with-steven-russell-of-rite-publishing.html",
            "url": "http://www.kyletaylored.com/how-to-fund-your-gaming-startup-on-kickstarter-with-steven-russell-of-rite-publishing.html",
            "title": "How to fund your gaming startup on Kickstarter with Steven Russell of Rite Publishing",
            "content_html": "<div><img class=\"post__image--center\" src=\"http://www.kyletaylored.com/media/posts/3/steven.png\" alt=\"Steven Russell of Rite Publishing\" width=\"2688\" height=\"1520\"></div>\n<div>I had the chance to go up to the University of North Texas in Denton and sit in on a seminar over how to fund your gaming startup on Kickstarter. It was actually really interesting and I learned a lot of common pitfalls and misconceptions when starting a Kickstarter.</div>\n<div>&nbsp;</div>\n<div>Steven Russell is the CEO of&nbsp;<a href=\"http://ritepublishing.com/home.php\">Rite Publishing</a>&nbsp; a micro press PDF publishing company that has produced over 150 products. Steven himself has more passions and interests than just what he does for his company. He's also a writer who wants to explore more of his ideas to try and bring them to fruition by using Kickstarter. This isn't just books and art, but also&nbsp;role playing board games such as his last Kickstarter project,&nbsp;<a href=\"http://www.kickstarter.com/projects/937759598/lords-of-gossamer-and-shadow-diceless-role-playing\">Lords of Gossamer and Shadow: Diceless Role-Playing</a>. He only asked for $1,000, but ended up receiving a little over $30,000 in pledges. Though it wasn't easy, Steven shared with us some of the things to keep in mind when planning a Kickstarter.</div>\n<div>&nbsp;</div>\n<div>Why use Kickstarter?</div>\n<div>\n<ul>\n<li>That's where the gamers are.</li>\n<li>Largest backing under the gaming category was the&nbsp;<a href=\"http://www.kickstarter.com/projects/ouya/ouya-a-new-kind-of-video-game-console\">OUYA</a>&nbsp;console, with over $8.5 million in funding.</li>\n<li>The biggest backing for a video game was for&nbsp;<a href=\"http://www.kickstarter.com/projects/inxile/torment-tides-of-numenera\">Torment: Tides of Numenera</a>, with $4.1 million.</li>\n<li>The most funded tabletop game was&nbsp;<a href=\"http://www.kickstarter.com/projects/200664283/deluxe-exalted-3rd-edition\">Deluxe Exalted 3rd Edition</a>&nbsp;with $684,000.</li>\n</ul>\n<div>&nbsp;</div>\n<div>What things do you need to budget for?</div>\n</div>\n<div>\n<ul>\n<li>Developers</li>\n<li>Writers, editors, proof readers</li>\n<li>Composers and sound</li>\n<li>Social media and marketing (time)</li>\n<li>Shipping - the most underrated part of the budget</li>\n</ul>\n<div>&nbsp;</div>\n<div>He made a lot of good points about stepping stones and what you should be prepared for along the way.</div>\n</div>\n<div>\n<ul>\n<li>Get to 30% funded as quickly as possible. It acts as tipping point for future backers, so the sooner you're funded, the more appealing you become to backers.</li>\n<li>The hardest part to budget is your rewards. You don't know how much your rewards are going to cost all the time, because you don't know how many of each will be bought.</li>\n<li>Be prepared for failure, success, and overwhelming success.</li>\n<li>The best time to launch a Kickstarter is the Friday after the 15th of a month. Think about it, when do the majority of people get paid?</li>\n<li>A good way to keep your costs down is using Creative Commons licensed materials, but always be sure to keep track of the license, i.e. print the page with the license for your own records.</li>\n</ul>\n<div>&nbsp;</div>\n<div>Overall, it was a really engaging talk. Steven was a great speaker and was really enthusiastic and knowledgeable about what you need to know to kick off your next Kickstarter. If you have an idea, make sure to keep some of these things in mind.</div>\n</div>",
            "image": "http://www.kyletaylored.com/media/posts/3/steven.png",
            "author": {
                "name": "Kyle Taylor"
            },
            "tags": [
                   "startup",
                   "kickstarter",
                   "UNT"
            ],
            "date_published": "2017-08-09T03:01:35-05:00",
            "date_modified": "2017-08-09T02:59:19-05:00"
        },
        {
            "id": "http://www.kyletaylored.com/new-dallas-coworking-space-the-grove.html",
            "url": "http://www.kyletaylored.com/new-dallas-coworking-space-the-grove.html",
            "title": "New Dallas Coworking Space: The Grove",
            "content_html": "<div><img class=\"post__image--center\" src=\"http://www.kyletaylored.com/media/posts/2/thegrove.png\" alt=\"The Grove Coworking\" width=\"960\" height=\"480\"></div>\n<div>&nbsp;</div>\n<div>I had the chance to attend the grand opening of&nbsp;<span style=\"text-decoration: underline;\"><a href=\"https://twitter.com/thegrovedallas\" target=\"_blank\" rel=\"noopener noreferrer\" shape=\"rect\">The Grove</a></span>, which is a new coworking space located right in downtown Dallas next to the 6th Floor Museum. They feature space and resources for entrepreneurs, freelancers, or consultants of any kind to help grow their business. If you need little creative mindset and just want to be around inspiring people, go hang out in their open coworking area and make some new friends.</div>\n<div>&nbsp;</div>\n<div>They offer an abundance of resources and office space, including 3 offices with atrium views and 3 conference rooms, over 1,000 square feet of open coworking space, free coffee, and even discounted DART passes. I actually took the DART to the event, and it was just a short walk a couple blocks from West End Station. For those of you looking for a professional mailing address, The Grove also offers virtual mailbox service for $50 a month.</div>\n<div>&nbsp;</div>\n<div>On a first impression, it was an incredibly well laid out space with a modern appeal. I thought it was very thought invoking and incredibly calm, which is great for a space for you to work in. I had the chance to mingle a little bit to find out that The Grove was actually an expansion of their already existing counterpart in Newhaven, Connecticut started by&nbsp;Ken Janke and&nbsp;Slate Ballard. Ken and his family had since then moved down to Texas and was inspired to create another space right here in the heart of North Texas. The group of people who attended the launch event were well rounded from various backgrounds, so it really shows that The Grove can cater to a wide range of businesses. It was a very classy opening, and even showcased some of the finest brewing out of Dallas, Deep Ellum Brewery and Armadillo Ale Works. I had a great time and took some pictures for you all, but they don't do them enough justice - go downtown and visit them yourself. You won't be disappointed.</div>\n<div>&nbsp;</div>\n<div><a href=\"http://www.flickr.com/photos/101871481@N07/sets/72157635555104044/\" target=\"_blank\" rel=\"noopener noreferrer\" shape=\"rect\">Flickr: The Grove Dallas - Grand Opening</a></div>\n<div><a href=\"http://www.flickr.com/photos/101871481@N07/sets/72157635555104044/\" target=\"_blank\" rel=\"noopener noreferrer\" shape=\"rect\">http://www.flickr.com/photos/101871481@N07/sets/72157635555104044/</a></div>",
            "image": "http://www.kyletaylored.com/media/posts/2/thegrove.png",
            "author": {
                "name": "Kyle Taylor"
            },
            "tags": [
                   "dallas",
                   "coworking"
            ],
            "date_published": "2017-08-09T03:01:35-05:00",
            "date_modified": "2017-08-09T02:59:31-05:00"
        },
        {
            "id": "http://www.kyletaylored.com/starting-fresh-on-postachio.html",
            "url": "http://www.kyletaylored.com/starting-fresh-on-postachio.html",
            "title": "Starting Fresh on Postach.io",
            "content_html": "<div><img src=\"http://www.kyletaylored.com/media/posts/1/snapshot-16b34fd2-245d-4384-9a41-ab513f349eae.jpg\" alt=\"Kyle pointing at Led Zeppelin poster\" width=\"2560\" height=\"1440\"></div>\n<div>&nbsp;</div>\n<div>I've been moving my blog around for about the past 2 years because I could never find a platform that I just really enjoyed. I tried Wordpress, Drupal, Tumblr, and even Jekyll/Octopress, but I was just never very happy with any of them. So the search continued.</div>\n<div>&nbsp;</div>\n<div>For the record, I write a lot... kind of. I grew up not really liking my english or history classes (though my teachers were really fascinating), I was more of a math &amp; science nerd. I hated writing essays, but it turned out that even though I didn't enjoy it, I was pretty good at it. I could take two paragraphs written from a partner on a group project and turn it into a one and a half page master piece through the&nbsp;<a href=\"http://www.wikihow.com/Fluff-up-a-Paper-to-Make-It-Look-Longer\">art of fluffing</a>&nbsp;(how do you think we get through college?).</div>\n<div>&nbsp;</div>\n<div>About a year ago I started writing more often, writing blogs for my company, sharing stuff&nbsp;on social media&nbsp;I find interesting, junk like that. In March 2013, I went to Brazil for&nbsp;<a href=\"http://www.sosummit.co/\">SOSummit</a>&nbsp;and while I was there&nbsp;I was asked if I'd like to write the&nbsp;<a href=\"https://www.startupdigest.com/digests/dallas\">Startup Digest for Dallas</a>. I'd like to consider myself a go-getter, so why the hell not, let's do it. I've had an Evernote account for awhile, but never put much use to it, so I started writing all of my blog posts and Startup Digest drafts in Evernote. Let me just say, it's changed my workflow completely. You write notes, tag those notes, put them in organized notebooks, and can then share those notes and notebooks with other people or the internet in general. IT'S SUCH A GREAT IDEA.</div>\n<div>&nbsp;</div>\n<div>Really though, it's quite efficient for me. I can then keep track of everything I write regardless if it's for the digest, my company's blog, or my own crazy rants. I write everything in Evernote because I never really trusted browser WYSIWYGs because we all fear the same things:</div>\n<div>\n<ol>\n<li>You're slightly an idiot and hit the back button on my browser, either via the button or some black magic with the backspace key.</li>\n<li>You own and Mac and did that two-finger swipe thing that makes you lose your mind as the browser goes back.</li>\n<li>You submit your post, aaaand the site crashes, or some random error that doesn't submit your post.</li>\n</ol>\n<p>And this is where&nbsp;<a href=\"http://postach.io\">Postach.io</a>&nbsp;comes in. I can't remember how I actually found out about Postach.io, but it was a godsend. \"The blogging platform powered by your Evernote documents.\" No CMS, no browser WYSIWYGs, no problems - just write your stuff in Evernote, tag it with \"published\", and sync. Poof, done. The best part is that you can do it from anywhere using the desktop app, browser editor, or even the Evernote app. I know it's very Tumblr like, but this fit perfectly into the way I already do my writing, so I think it's just fantastic.</p>\n</div>\n<div>&nbsp;</div>\n<div>Anyways, this isn't some kind of advertisement for Postach.io, but I do think it's super cool and I'm behind them all the way. I'll be writing all my blog posts on here now relating to startups, Dallas, entrepreneurs, technology, web development, blah blah blah, but I thought I'd at least give a little shout out to this amazing platform because I honestly think it's incredible.</div>\n<div>&nbsp;</div>\n<div>lf you're wondering about my featured image at the top, I'm just being weird hanging out with my wife's giant Led Zeppelin picture she likes to keep on the wall. I'm out.</div>",
            "image": "http://www.kyletaylored.com/media/posts/1/screen-shot-2017-08-09-at-23847-am.png",
            "author": {
                "name": "Kyle Taylor"
            },
            "tags": [
            ],
            "date_published": "2017-08-09T03:01:35-05:00",
            "date_modified": "2017-08-09T02:40:02-05:00"
        },
        {
            "id": "http://www.kyletaylored.com/denton-creative-mixer-building-startup-communities-from-the-inside-out.html",
            "url": "http://www.kyletaylored.com/denton-creative-mixer-building-startup-communities-from-the-inside-out.html",
            "title": "Denton Creative Mixer - Building startup communities from the inside out",
            "content_html": "<p><img class=\"post__image--center\" src=\"http://www.kyletaylored.com/media/posts/4/335c2eb7-e8ae-4283-86cb-b8b0097a1678.jpg\" alt=\"Oak Street Draft House\" width=\"2048\" height=\"1366\"></p>\n<div>&nbsp;</div>\n<div>Last night I went to Oak Street Draft House where I had the chance to join a&nbsp;&nbsp;group of over 150 of the most creative and talented individuals in the city of Denton. This was an event put on by Heather Gregory and Tristan Bynum of the forthcoming&nbsp;<a href=\"https://www.facebook.com/makerspacedenton\">Maker Space Denton</a>&nbsp;that gave the crowd a chance to hear the success stories of local startups and some tips they've learned along the way. This was a great event that brought a lot of creative individuals together to network and talk about their own ideas for new businesses and startups.</div>\n<div>&nbsp;</div>\n<div>The Maker Space is a new collaborative workspace coming to Denton this fall that is aimed at providing space, tools, and resources to freelance designers, developers, artists, sculptors and other innovative individuals who don't have enough capital to open their own shop, or just want to work in a synergetic environment. It's great to see these two come out and ask individuals in the community what their needs are to be successful.</div>\n<div>&nbsp;</div>\n<div>Speakers from the&nbsp;<a href=\"http://dentonmarket.org/\">Denton Community Market</a>&nbsp;shared how they got started with just a group of people showing up to a basement room in city hall because they were interested in the concept and had things to share. Other local companies like&nbsp;<a href=\"http://www.panector.com/\">Pan Ector</a>&nbsp;and&nbsp;<a href=\"http://triplethreatpress.com/\">Triple Threat Press</a>&nbsp;started in a garage or out of the local university and obtained resources through the Denton Chamber of Commerce and small business development center, which are ran for free by people like you and me. Even the local college, University of North Texas, started the Innovation Greenhouse which is partnering up with the city in ways to better benefit and help the community in their new business ventures</div>\n<figure class=\"post__image post__image--right\" contenteditable=\"false\"><img src=\"http://www.kyletaylored.com/media/posts/4/0cc4579e-b762-4bf6-b59d-6ef8372c4d00.jpg\" alt=\"The crowd at the Denton Creative Mixer\" width=\"960\" height=\"577\">\n<figcaption contenteditable=\"true\">Crowd at the Denton Creative Mixer</figcaption>\n</figure>\n<div>&nbsp;</div>\n<div>At the mixer, after the main set of speeches, Kevin Roden asked if anyone had any announcements. I walked up with some others and he introduced me as bringing the first&nbsp;<a title=\"Startup Weekend Denton\" href=\"http://denton.startupweekend.org/\">Startup Weekend to Denton</a>&nbsp;this past January. I talked a little bit about our movement of building the startup and tech community like&nbsp;<a href=\"http://createdenton.com/\">CreateDenton.com</a>, bringing in more events like Startup Weekend and hackathons, which led to talking about the open data movement coming to Denton that already started with the creation of&nbsp;<a href=\"http://votedenton.org/\">VoteDenton.org</a>&nbsp;using city GIS data. After I was done, I had multiple people come up to me to tell me they were interested in a hackathon, and what they were working on, even asking what my opinions were, and what they can do to get more involved. It was fantastic!</div>\n<div>&nbsp;</div>\n<div>Denton is very unique in the way that everyone cares about the success of the community - the city, government officials, small business owners, and local citizens are all part of this growing entrepreneurial community that is being fostered in Denton. The people are what make this city the way it is, and your voice matters. A great example is operation of food trucks in the city of Denton. Up until about a year ago, the city ordinances did not accommodate mobile food trucks very well. With the help of a city councilman and the opinions and suggestions of a group of citizens, over the course of a few months Denton was able to come up with a new set of ordinances that allowed the creation of new thriving food trucks, such as&nbsp;<a href=\"https://www.facebook.com/Thepickledcarrot\">The Pickled Carrot.</a></div>\n<div>&nbsp;</div>\n<div>As some of you may have read about me, my personal goal is to build and grow the startup community in North Texas, and Denton is a prime example of how you do it. Go to meetups and mixers, shake some hands and just talk to people about what they're working on, what they want, and follow up with, \"How can I help?\" Those are the four most inspiring words you will ever use, because now they know that they aren't alone. People like me are all around you, people who get involved with the community and want to help. Why do we do this? It's exciting, it's a little fun, and maybe we're all just a little crazy to think that we can change the world.</div>\n<div>&nbsp;</div>\n<p>I'm looking forward to attending more events like this, and if you're ever in the area and want to experience the community of Denton, let me know and we'll talk. And if that's not enough incentive, Oak Street Draft House has a craft beer selection that will blow your mind.</p>\n<div>On Photo credits go to&nbsp;<a href=\"https://www.facebook.com/pages/On-The-Record-Magazine/176125129124628\">On The Record Magazine</a>, a summer publication of the North Texas Daily.</div>",
            "image": "http://www.kyletaylored.com/media/posts/4/335c2eb7-e8ae-4283-86cb-b8b0097a1678.jpg",
            "author": {
                "name": "Kyle Taylor"
            },
            "tags": [
                   "startup",
                   "denton",
                   "creative"
            ],
            "date_published": "2017-08-09T03:01:35-05:00",
            "date_modified": "2017-08-09T03:01:28-05:00"
        }
    ]
}
